Высшая инженерная школа
Высшая школа экономики и менеджмента
Институт государственного управления и предпринимательства
Институт гуманитарных наук и искусств
Институт естественных наук и математики
Институт математики и компьютерных наук
Институт материаловедения и металлургии
Институт новых материалов и технологий
Институт радиоэлектроники и информационных технологий–РтФ
Институт социальных и политических наук
Институт технологий открытого образования
Институт физической культуры, спорта и молодежной политики
Институт фундаментального образования
Механико-машиностроительный институт
Специализированный учебно-научный центр
Строительный институт
Уральский энергетический институт
Факультет повышения квалификации преподавателей и профессиональной подготовки
Физико-технологический институт
Химико-технологический институт
Учебный военный центр
Факультет военного обучения